keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxSent_regdef.h
/** \\brief  OCDS Control and Status */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SENT_OCS_Bits B;
} Ifx_SENT_OCS;

/** \\brief  Receive Data Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SENT_RDR_Bits B;
} Ifx_SENT_RDR;

/** \\brief  Receive Time Stamp Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SENT_RTS_Bits B;
} Ifx_SENT_RTS;

/** \\brief  Time Stamp Predivider Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SENT_TPD_Bits B;
} Ifx_SENT_TPD;

/** \\brief  Time Stamp Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SENT_TSR_Bits B;
} Ifx_SENT_TSR;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Sent_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */

/** \\brief  Channel objects */
typedef volatile struct _Ifx_SENT_CH
{
    Ifx_SENT_CH_CPDR CPDR;                  /**< \brief 0, Channel Pre Divider Register */
    Ifx_SENT_CH_CFDR CFDR;                  /**< \brief 4, Channel Fractional Divider Register */
    Ifx_SENT_CH_RCR RCR;                    /**< \brief 8, Receiver Control Register */
    Ifx_SENT_CH_RSR RSR;                    /**< \brief C, Receive Status Register */
    Ifx_SENT_CH_SDS SDS;                    /**< \brief 10, Serial Data and Status Register */
    Ifx_SENT_CH_IOCR IOCR;                  /**< \brief 14, Input and Output Control Register */
    Ifx_SENT_CH_SCR SCR;                    /**< \brief 18, SPC Control Register */
    Ifx_SENT_CH_VIEW VIEW;                  /**< \brief 1C, Receive Data View Register */
    Ifx_SENT_CH_INTSTAT INTSTAT;            /**< \brief 20, Interrupt Status Register */
    Ifx_SENT_CH_INTSET INTSET;              /**< \brief 24, Interrupt Set Register */
    Ifx_SENT_CH_INTCLR INTCLR;              /**< \brief 28, Interrupt Clear Register */
    Ifx_SENT_CH_INTEN INTEN;                /**< \brief 2C, Interrupt Enable Register */
    Ifx_SENT_CH_INP INP;                    /**< \brief 30, Interrupt Node Pointer Register */
    Ifx_SENT_CH_WDT WDT;                    /**< \brief 34, Watch Dog Timer Register */
    unsigned char reserved_38[8];           /**< \brief 38, \internal Reserved */
} Ifx_SENT_CH;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Sent_struct
 * \{  */
/******************************************************************************/
/** \name Object L0
 * \{  */

/** \\brief  SENT object */
typedef volatile struct _Ifx_SENT
{
    Ifx_SENT_CLC CLC;                       /**< \brief 0, Clock Control Register */
    unsigned char reserved_4[4];            /**< \brief 4, \internal Reserved */
    Ifx_SENT_ID ID;                         /**< \brief 8, Module Identification Register */
    Ifx_SENT_FDR FDR;                       /**< \brief C, SENT Fractional Divider Register */
    unsigned char reserved_10[4];           /**< \brief 10, \internal Reserved */
    Ifx_SENT_INTOV INTOV;                   /**< \brief 14, Interrupt Overview Register */
    Ifx_SENT_TSR TSR;                       /**< \brief 18, Time Stamp Register */
    Ifx_SENT_TPD TPD;                       /**< \brief 1C, Time Stamp Predivider Register */
    unsigned char reserved_20[96];          /**< \brief 20, \internal Reserved */
    Ifx_SENT_RDR RDR[15];                   /**< \brief 80, Receive Data Register */
    unsigned char reserved_BC[44];          /**< \brief BC, \internal Reserved */
    Ifx_SENT_OCS OCS;                       /**< \brief E8, OCDS Control and Status */
    Ifx_SENT_KRSTCLR KRSTCLR;               /**< \brief EC, Kernel Reset Status Clear Register */
    Ifx_SENT_KRST1 KRST1;                   /**< \brief F0, Kernel Reset Register 1 */
    Ifx_SENT_KRST0 KRST0;                   /**< \brief F4, Kernel Reset Register 0 */
    Ifx_SENT_ACCEN1 ACCEN1;                 /**< \brief F8, Access Enable Register 1 */
    Ifx_SENT_ACCEN0 ACCEN0;                 /**< \brief FC, Access Enable Register 0 */
    Ifx_SENT_CH CH[15];                     /**< \brief 100, Channel objects */
    unsigned char reserved_4C0[1472];       /**< \brief 4C0, \internal Reserved */
    Ifx_SENT_RTS RTS[15];                   /**< \brief A80, Receive Time Stamp Register */
    unsigned char reserved_ABC[68];         /**< \brief ABC, \internal Reserved */
} Ifx_SENT;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXSENT_REGDEF_H */
